# Table exploration

In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [8]:
%%sql
SELECT * FROM sqlite_master WHERE type='table'

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [10]:
%%sql
SELECT * FROM facts LIMIT 5

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

# Minimum and maximum population and population growth

In [11]:
%%sql
SELECT MIN(population),MAX(population),MIN(population_growth),MAX(population_growth) FROM facts

Done.

[(0, 7256490011, 0.0, 4.02)]

In [15]:
%%sql
SELECT * FROM facts
WHERE population == (SELECT MAX(population) FROM facts)

Done.

[(261, 'xx', 'World', None, None, None, 7256490011, 1.08, 18.6, 7.8, None)]

In [16]:
%%sql
SELECT * FROM facts
WHERE population == (SELECT MIN(population) FROM facts)

Done.

[(250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None)]

# Countries with above average population and below average area

In [19]:
%%sql
SELECT AVG(population) avg_pop, AVG(area) avg_area FROM facts

Done.

[(62094928.32231405, 555093.546184739)]

In [21]:
%%sql
SELECT name,population,area FROM facts
WHERE population > (SELECT AVG(population) FROM facts) AND area < (SELECT AVG(area) FROM facts)

Done.

[('Bangladesh', 168957745, 148460),
 ('Germany', 80854408, 357022),
 ('Japan', 126919659, 377915),
 ('Philippines', 100998376, 300000),
 ('Thailand', 67976405, 513120),
 ('United Kingdom', 64088222, 243610),
 ('Vietnam', 94348835, 331210)]

# Which countries have the highest ratios of water to land?

In [27]:
%%sql
SELECT name,CAST(area_water as Float)/CAST(area_land as Float) water_to_land FROM facts
ORDER BY water_to_land DESC
LIMIT 5

Done.

[('British Indian Ocean Territory', 905.6666666666666),
 ('Virgin Islands', 4.520231213872832),
 ('Puerto Rico', 0.5547914317925592),
 ('Bahamas, The', 0.3866133866133866),
 ('Guinea-Bissau', 0.2846728307254623)]

# Which countries have more water than land?

In [28]:
%%sql
SELECT name FROM facts
WHERE area_water > area_land

Done.

[('British Indian Ocean Territory',), ('Virgin Islands',)]

# Which countries will add the most people to their population next year?

In [38]:
%%sql
SELECT name, (population * population_growth  / 100) total_growth FROM facts
ORDER BY total_growth DESC
LIMIT 5

Done.

[('World', 78370092.1188),
 ('India', 15270686.1248),
 ('China', 6153684.246),
 ('Nigeria', 4448270.372),
 ('Pakistan', 2906653.3662)]

# Which countries have a higher death rate than birth rate?

In [40]:
%%sql
SELECT name,birth_rate,death_rate FROM facts
WHERE birth_rate < death_rate
LIMIT 5

Done.

[('Austria', 9.41, 9.42),
 ('Belarus', 10.7, 13.36),
 ('Bosnia and Herzegovina', 8.87, 9.75),
 ('Bulgaria', 8.92, 14.44),
 ('Croatia', 9.45, 12.18)]